{
  "generated_on": "2025-10-20T04:34:16.193324",
  "entries": [
    {
      "case_name": "Surendra Mohan Arora v. HDFC Bank Ltd.",
      "year": 2014,
      "court": "Supreme Court of India",
      "sector": "Banking / Consumer Regulations",
      "issue": "Constitutionality of Consumer Protection Regulations, 2005 (Regulation 15) and procedural powers of National Commission.",
      "judgement_summary": "The Supreme Court held that the Regulations framed under Section 30A of the Consumer Protection Act, 1986 were intra vires and the power to deal with review applications lies with the National Commission; no mischief was found in Regulation 15(2). The HC's challenge was rejected and the Regulations were upheld.",
      "principle_established": "Consumer Protection Regulations (2005) framed under the statutory power are valid; National Commission has procedural power to decide review petitions as per Regulations.",
      "impact": "Clarified procedural competence of National Consumer Commission and upheld regulatory framework under the Act.",
      "important_excerpts": [
        "Court minutely gone through regulation 15(2) of the Regulations and found that power to deal with review applications lies with Commission."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file2"
    },
    {
      "case_name": "Debashis Sinha v. RNR Enterprises",
      "year": 2020,
      "court": "Supreme Court / NCDRC (reported)",
      "sector": "Real Estate",
      "issue": "Non-provision of amenities promised in brochure/advertisement and lack of completion certificate.",
      "judgement_summary": "The Court found that the complainants failed to establish entitlement to the extra amenities without payment; some amenities were available but for further amenities contract terms required extra payment. The absence of completion certificate was a statutory failure but occupation without CC affected complainants' position.",
      "principle_established": "Where agreement/ conveyance specifies additional payments for extra amenities, buyers cannot claim them free; completion certificate is statutory requirement and occupation without it affects remedy.",
      "impact": "Clarified contractual entitlements vs promotional brochures; highlighted role of completion certificate in possession disputes.",
      "important_excerpts": [
        "Certain extra facilities have already been provided but if the Complainant want to access more amenities, then as per the agreement for sale, they would have to pay extra."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file3"
    },
    {
      "case_name": "G.M. Northern Railway State Entry Road, New Delhi v. Manoj Kumar",
      "year": 2013,
      "court": "NCDRC / District Forum (reported)",
      "sector": "Railways / Transport",
      "issue": "Improper information regarding service of trains — cancellation not communicated leading to passenger loss.",
      "judgement_summary": "Complainant booked a three-tier AC ticket; on arrival found train service cancelled without proper communication. District Forum and subsequent forums examined facts and reliefs were considered for inadequate information and deficiency of service.",
      "principle_established": "Railway services fall within 'service' and deficiency of service complaints can be maintained under Consumer Protection provisions.",
      "impact": "Reinforced duty on railways to provide accurate service information and compensatory relief where deficiency established.",
      "important_excerpts": [
        "Accordingly, consumer grievances with the railways can be brought under the purview of the Sec. 2(1)(g) of the Act, which deals with deficiency of services."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file0"
    },
    {
      "case_name": "Spicejet Ltd. v. Dinesh Kumar & Anr.",
      "year": 2013,
      "court": "State Commission / NCDRC (reported)",
      "sector": "Airlines / Travel",
      "issue": "Validity of Aadhaar as travel document for international travel to Nepal and refusal of check-in.",
      "judgement_summary": "Complainant produced e-ticket and Aadhaar card; airline refused Aadhaar for travel to Nepal. District forum held airline liable; State Commission dismissed airline's appeal. Case highlights limits of Aadhaar as travel/document ID for cross-border travel.",
      "principle_established": "Aadhaar may not be treated as a universally valid travel document for all destinations; carriers can refuse non-standard ID for international travel.",
      "impact": "Clarified identification requirements for airlines and limits to Aadhaar acceptance for foreign travel.",
      "important_excerpts": [
        "The airlines company did not accept Aadhaar card as a valid/acceptable travel document for travel to Nepal (Kathmandu) and refused to issue a boarding pass."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file8"
    },
    {
      "case_name": "State of U.P. v. All U.P. Consumer Protection Bar Association",
      "year": 2016,
      "court": "Supreme Court of India",
      "sector": "Consumer Fora / Administration",
      "issue": "Administrative deficiencies and infrastructure problems in Consumer Fora (district, state, national).",
      "judgement_summary": "The Supreme Court reviewed an interim report noting inadequate infrastructure, shortages of manpower, non-enforcement of orders and administrative apathy. It issued directions for uniform rules, appointment of members, discipline, and administrative improvements.",
      "principle_established": "Consumer forums require adequate administrative and infrastructural support; Court can issue directions for systemic improvements.",
      "impact": "Led to directions for framing model rules, appointment of officials and remedial administrative measures for consumer fora.",
      "important_excerpts": [
        "The interim report provided an unfortunate reflection of the state of affairs in the consumer fora at the district, state and national level."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file6"
    },
    {
      "case_name": "Birla Technologies Limited v. Neutral Glass and Allied Industries Limited",
      "year": 2010,
      "court": "Supreme Court of India",
      "sector": "IT / Software",
      "issue": "Whether custom-developed software is a 'good' under Consumer Protection Act, 1986.",
      "judgement_summary": "Court considered software development contract and delivery of modules; discussed whether software qualifies as a 'good' and whether deficiencies in software/services fall under consumer jurisdiction.",
      "principle_established": "Custom software can fall within the ambit of 'goods' and related disputes may be amenable to consumer fora depending on contract and service characteristics.",
      "impact": "Important for disputes over software development projects and remedies under consumer law.",
      "important_excerpts": [
        "The Appellant had sent a detailed proposal for developing certain computer software... several Modules had been successfully installed."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file10"
    },
    {
      "case_name": "Natarajan Bohidar v. Citibank N.A.",
      "year": 2014,
      "court": "NCDRC / State Commission (reported)",
      "sector": "Banking / Loans",
      "issue": "Sale of vehicle by bank without pre-sale notice, enforcement of district forum order.",
      "judgement_summary": "Bank repossessed and sold car; dispute arose over procedure and prior notice. The Supreme Court allowed appeal restoring the District Forum order and directed implementation within six weeks, observing bank's actions and obligations.",
      "principle_established": "Banks must follow prescribed repossession and sale procedures; consumer forums can grant reliefs where procedure violated.",
      "impact": "Emphasized proper notice/ procedure before sale and the enforceability of District Forum orders.",
      "important_excerpts": [
        "Appellant fraudulently, it was all the more obligatory on the Respondent-Bank to have taken action against its employees. Appeal was allowed."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file19"
    },
    {
      "case_name": "Vikas Garg v. The State of Rajasthan",
      "year": 2018,
      "court": "Supreme Court of India",
      "sector": "Mediation / ADR",
      "issue": "Execution and listing of mediated settlements — prompt enforcement.",
      "judgement_summary": "The Court directed that mediation settlements should be given effect to immediately and criticized delays in listing and implementing mediated outcomes; administrative responsibility was to be fixed.",
      "principle_established": "Mediated settlements must be implemented promptly; Courts and registry should ensure administrative compliance.",
      "impact": "Strengthened the effectiveness of mediation by directing quicker administrative action and enforcement.",
      "important_excerpts": [
        "The mediation settlement should be given effect to immediately."
      ],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file17"
    },
    {
      "case_name": "Surinder Kumar Beri v. Deepak Beri and Ors.",
      "year": 2016,
      "court": "High Court / NCDRC (reported)",
      "sector": "Real Estate / Consumer Disputes",
      "issue": "Family/contractual disputes involving property and consumer remedies (reported in the PDF).",
      "judgement_summary": "Case appears in the list of judgments and deals with dispute resolution under consumer fora; see full entry in PDF for details.",
      "principle_established": "Consumer fora may handle complex civil/contractual disputes depending on the nature of relief and deficiency alleged.",
      "impact": "Illustrative of types of property/real-estate consumer disputes handled by forums.",
      "important_excerpts": [],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file11"
    },
    {
      "case_name": "Magna Firecorp Ltd. v. Rajesh Kumar Tiwari (Magma Firecorp)",
      "year": 2020,
      "court": "Supreme Court of India",
      "sector": "Product Liability / Consumer Protection",
      "issue": "Product liability and consumer remedies (listed in the PDF's case list).",
      "judgement_summary": "Listed as a 2020 Supreme Court case relevant to product liability and consumer remedies — users should consult the full PDF entry for the detailed reasoning and findings.",
      "principle_established": "Recent high-court / SC precedents expanding product liability jurisprudence.",
      "impact": "Important precedent for product liability actions under newer consumer law frameworks.",
      "important_excerpts": [],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file11"
    },
    {
      "case_name": "Surendra Kumar Tyagi v. Jagat Nursing Home and Hospital",
      "year": 2010,
      "court": "NCDRC (reported)",
      "sector": "Medical / Healthcare",
      "issue": "Medical negligence / deficiency in services in hospital care.",
      "judgement_summary": "Appears in list of cases; demonstrates medical negligence and consumer redressal cases present in the period 2008-2020.",
      "principle_established": "Medical services can fall within 'service' under consumer protection law and give rise to remedies.",
      "impact": "Used as reference for consumer complaints against healthcare providers.",
      "important_excerpts": [],
      "source_file": "Landmark Judgements on Consumer Law and Practice 2008-2020.pdf",
      "file_citation": "fileciteturn1file11"
    }
  ]
}